// Задача показать квадрат числа

int a = new Random().Next(1,15);
Console.Write("выбрано число: ");
Console.WriteLine(a);
Console.Write("квадрат числа: ");
Console.WriteLine(a*a);

